---
title: WorksharingSaveAsOptions
classe: Autodesk.Revit.DB.WorksharingSaveAsOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# WorksharingSaveAsOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean ClearTransmitted { get; set; }` | `worksharingSaveAsOptions.ClearTransmitted` | Boolean |
| `Boolean IsValidObject { get; }` | `worksharingSaveAsOptions.IsValidObject` | Boolean |
| `SimpleWorksetConfiguration OpenWorksetsDefault { get; set; }` | `worksharingSaveAsOptions.OpenWorksetsDefault` | SimpleWorksetConfiguration |
| `Boolean SaveAsCentral { get; set; }` | `worksharingSaveAsOptions.SaveAsCentral` | Boolean |
| `Void Dispose()` | `worksharingSaveAsOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```